CASE_I/reference/fine/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    pFinal
    {
        $p
        tolerance       1e-8;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    UFinal
    {
        $U
    }
}

PIMPLE
{
    nOuterCorrectors	1;
    nCorrectors		2;
    nNonOrthogonalCorrectors 0;

    pRefPoint       (-0.149 0 0);
    pRefValue       0;

    checkMeshCourantNo		yes;
}

relaxationFactors
{
    fields
    {
        //p               0.3;
    }
    equations
    {
        //U               0.7;
        //".*"            1;
    }
}


// ************************************************************************* //
